class AppString {
  static const String appName = 'غرس الجنة';
  static const String welcomeMessage = 'املئ الحقول لكي نُتم غرسك';
  static const String complateMessage = 'نحتاج إلى بعض المعلومات الأساسية لتخصيص تجربتك وتحليل غرساتك اليومية. بذلك، يمكنك متابعة إنجازاتك بسهولة ومعرفة عدد الأشجار التي غرستها في جنتك يوميًا.';

  static const String text1 = '“سبحان الله، والحمدلله، ولا إله إلا الله، والله أكبر”';
  static const String text2 = 'سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ';
  static const String tree = 'لشجر';
  static const String palmTree = 'للنخل';
  static const String loadingMessage = 'Loading...';
  static const String noDataMessage = 'No data available';
  static const String retryButtonText = 'Retry';
  static const String cancelButtonText = 'Cancel';

  static const List<String> text1Parts = [
    'عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ وَهُوَ يَغْرِسُ غَرْسًا، فَقَالَ:  يَا أَبَا هُرَيْرَةَ، مَا الَّذِي تَغْرِسُ؟  قُلْتُ: غِرَاسًا لِي، قَالَ:  أَلَا أَدُلُّكَ عَلَى غِرَاسٍ خَيْرٍ لَكَ مِنْ هَذَا؟  قَالَ: بَلَى يَا رَسُولَ اللَّهِ، قَالَ:  قُلْ:',
    ' سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ، يُغْرَسْ لَكَ بِكُلِّ وَاحِدَةٍ شَجَرَةٌ فِي الْجَنَّةِ',
    '  ابن ماجه (3807).',
  ];

  static const List<String> text2Parts = [
    'حديث جابر رضي الله عنه أن النبي صلى الله عليه وسلم قال:  مَنْ قَالَ :',
    ' سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ ، غُرِسَتْ لَهُ نَخْلَةٌ فِي الجَنَّةِ  ',
    'رواه الترمذي (3464) وقال المنذري: إسناده جيد، وحسنه الحافظ ابن حجر في "نتائج الأفكار"(1/104)، وصححه الألباني في "السلسلة الصحيحة"(64).',
  ];
}